{"keras_version": "2.0.6", "config": [{"config": {"output_dim": 32, "input_length": null, "embeddings_constraint": null, "input_dim": 5000, "batch_input_shape": [null, null], "mask_zero": false, "trainable": true, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "dtype": "float32", "name": "embedding_1"}, "class_name": "Embedding"}, {"config": {"rate": 0.2, "name": "spatial_dropout1d_1", "trainable": true}, "class_name": "SpatialDropout1D"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unroll": false, "use_bias": true, "unit_forget_bias": true, "recurrent_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "implementation": 0, "return_state": false, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_regularizer": null, "stateful": false, "name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.2, "bias_constraint": null, "return_sequences": false, "recurrent_regularizer": null, "trainable": true, "units": 100, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.2}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "units": 29, "activation": "sigmoid", "name": "dense_1", "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}