{"keras_version": "2.0.6", "config": [{"config": {"trainable": true, "activity_regularizer": null, "batch_input_shape": [null, null], "embeddings_constraint": null, "mask_zero": false, "input_length": null, "input_dim": 5000, "name": "embedding_1", "output_dim": 32, "embeddings_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "dtype": "float32"}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "spatial_dropout1d_1", "rate": 0.2}, "class_name": "SpatialDropout1D"}, {"config": {"bias_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.2, "recurrent_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "trainable": true, "kernel_regularizer": null, "implementation": 0, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "bias_constraint": null, "dropout": 0.2, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm_1", "units": 100, "unit_forget_bias": true, "stateful": false}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "name": "dense_1", "units": 29}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}